# GetEnumeratorNG Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryElement..::..GetEnumeratorNG Method
GeometryElement Class See Also
---
Returns an enumerator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
internal IEnumerator GetEnumeratorNG()
```

Visual Basic
---
```text
Friend Function GetEnumeratorNG As IEnumerator
```

Visual C++
---
```text
internal:
virtual IEnumerator^ GetEnumeratorNG() sealed
```

# ### Return Value
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.
# ### Implements
IEnumerable..::..GetEnumerator()()()()
# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace